99percentpeople/esp32qjs/components/esp32qjs_runtime/src/esp32qjs_runtime.c
#include "esp32qjs_runtime.h"

#include <stdio.h>
#include <string.h>

#include "sdkconfig.h"
#include "esp_attr.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_memory_utils.h"
#include "esp_system.h"
#include "esp_task_wdt.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "nvs.h"
#include "nvs_flash.h"
#if CONFIG_ESP32QJS_ENABLE_REPL
#include "esp32qjs_interactive.h"
#endif

#define ESP32QJS_REBOOT_MARKER_MAGIC UINT32_C(0x51534a52)
#define ESP32QJS_BOOT_GUARD_NAMESPACE "qjs_rt"
#define ESP32QJS_BOOT_GUARD_VERSION 1U
#define ESP32QJS_OUTER_HEARTBEAT_WAIT_MS 250U

typedef struct {
    uint32_t magic;
    uint32_t checksum;
    char reason[ESP32_MQUICKJS_CONTROL_REASON_MAX + 1U];
} esp32qjs_reboot_marker_t;

static RTC_NOINIT_ATTR esp32qjs_reboot_marker_t s_reboot_marker;

static const char *TAG = "esp32qjs_runtime";
static esp32qjs_runtime_t *s_active_runtime;

struct esp32qjs_runtime {
    esp32qjs_runtime_config_t config;
    esp32_mquickjs_runtime_t engine;
    JSContext *ctx;
    void *js_heap;
    TaskHandle_t task;
    SemaphoreHandle_t stopped;
    volatile bool stop_requested;
    volatile bool running;
    portMUX_TYPE lifecycle_lock;
    esp32_mquickjs_runtime_state_t state;
    uint32_t generation;
    uint32_t restart_count;
    uint64_t generation_started_us;
    char last_restart_reason[ESP32_MQUICKJS_CONTROL_REASON_MAX + 1U];
    bool pending_control;
    esp32_mquickjs_control_action_t pending_action;
    char pending_reason[ESP32_MQUICKJS_CONTROL_REASON_MAX + 1U];
    uint64_t pending_requested_at_ms;
    uint64_t pending_due_at_ms;
    char software_reason[ESP32_MQUICKJS_CONTROL_REASON_MAX + 1U];
    bool software_reason_available;
    bool littlefs_mounted;
    bool secondary_littlefs_mounted;
    bool watchdog_registered;
    esp_task_wdt_user_handle_t js_watchdog_user;
    bool js_watchdog_registered;
    uint64_t last_outer_heartbeat_us;
    bool boot_guard_ready;
    esp32_mquickjs_safe_mode_t safe_mode;
    bool failure_reboot_pending;
    uint8_t startup_failure_count;
    bool startup_pending;
    bool startup_stabilizing;
    uint64_t startup_returned_us;
    char last_startup_failure_reason[ESP32_MQUICKJS_CONTROL_REASON_MAX + 1U];
    char startup_script[ESP32_MQUICKJS_HOST_STARTUP_PATH_MAX];
    char task_name[ESP32_MQUICKJS_HOST_TASK_NAME_MAX];
    char secondary_littlefs_partition_label[ESP32_MQUICKJS_HOST_PARTITION_LABEL_MAX];
    char secondary_littlefs_base_path[ESP32_MQUICKJS_FS_ROOT_MAX];
#if CONFIG_ESP32QJS_ENABLE_REPL
    esp32qjs_interactive_host_t interactive_host;
    esp32qjs_interactive_banner_t banner;
#endif
};

static bool runtime_cooperate(void *opaque);
static void runtime_feed_js_watchdog(esp32qjs_runtime_t *runtime);

static bool runtime_reset_is_startup_failure(esp_reset_reason_t reason)
{
    return reason == ESP_RST_PANIC || reason == ESP_RST_INT_WDT ||
           reason == ESP_RST_TASK_WDT || reason == ESP_RST_WDT ||
           reason == ESP_RST_CPU_LOCKUP;
}

static const char *runtime_reset_failure_reason(esp_reset_reason_t reason)
{
    switch (reason) {
    case ESP_RST_TASK_WDT:
        return "task-watchdog";
    case ESP_RST_INT_WDT:
        return "interrupt-watchdog";
    case ESP_RST_WDT:
        return "watchdog";
    case ESP_RST_CPU_LOCKUP:
        return "cpu-lockup";
    case ESP_RST_PANIC:
    default:
        return "panic";
    }
}

static void runtime_copy_string(char *target,
                                size_t target_size,
                                const char *source,
                                const char *fallback)
{
    const char *value = source != NULL && source[0] != '\0' ? source : fallback;

    if (target_size == 0) {
        return;
    }
    snprintf(target, target_size, "%s", value != NULL ? value : "");
}

static bool runtime_boot_guard_commit(esp32qjs_runtime_t *runtime)
{
    nvs_handle_t handle;
    esp_err_t err;

    if (runtime == NULL || !runtime->boot_guard_ready) {
        return false;
    }
    err = nvs_open(ESP32QJS_BOOT_GUARD_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "failed to open startup guard NVS: %s", esp_err_to_name(err));
        return false;
    }
    err = nvs_set_u8(handle, "version", ESP32QJS_BOOT_GUARD_VERSION);
    if (err == ESP_OK) {
        err = nvs_set_u8(handle, "failures", runtime->startup_failure_count);
    }
    if (err == ESP_OK) {
        err = nvs_set_u8(handle, "failed", runtime->failure_reboot_pending ? 1U : 0U);
    }
    if (err == ESP_OK) {
        if (runtime->last_startup_failure_reason[0] != '\0') {
            err = nvs_set_str(handle, "reason",
                              runtime->last_startup_failure_reason);
        } else {
            esp_err_t erase_err = nvs_erase_key(handle, "reason");

            if (erase_err != ESP_OK && erase_err != ESP_ERR_NVS_NOT_FOUND) {
                err = erase_err;
            }
        }
    }
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    nvs_close(handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "failed to persist startup guard: %s", esp_err_to_name(err));
        return false;
    }
    return true;
}

static bool runtime_boot_guard_load(esp32qjs_runtime_t *runtime)
{
    nvs_handle_t handle;
    esp_err_t err;
    uint8_t version = 0;
    uint8_t value = 0;
    size_t reason_size = sizeof(runtime->last_startup_failure_reason);

    if (runtime == NULL || !runtime->config.startup_guard) {
        return false;
    }
    err = nvs_flash_init();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "startup guard cannot initialize NVS: %s", esp_err_to_name(err));
        return false;
    }
    err = nvs_open(ESP32QJS_BOOT_GUARD_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "startup guard cannot open NVS: %s", esp_err_to_name(err));
        return false;
    }
    err = nvs_get_u8(handle, "version", &version);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        err = nvs_erase_all(handle);
        if (err == ESP_OK) {
            err = nvs_set_u8(handle, "version", ESP32QJS_BOOT_GUARD_VERSION);
        }
        if (err == ESP_OK) {
            err = nvs_commit(handle);
        }
    } else if (err == ESP_OK && version != ESP32QJS_BOOT_GUARD_VERSION) {
        err = nvs_erase_all(handle);
        if (err == ESP_OK) {
            err = nvs_set_u8(handle, "version", ESP32QJS_BOOT_GUARD_VERSION);
        }
        if (err == ESP_OK) {
            err = nvs_commit(handle);
        }
    }
    if (err != ESP_OK) {
        nvs_close(handle);
        ESP_LOGE(TAG, "startup guard has invalid NVS state: %s", esp_err_to_name(err));
        return false;
    }
    if (nvs_get_u8(handle, "failures", &value) == ESP_OK) {
        runtime->startup_failure_count = value;
    }
    value = 0;
    if (nvs_get_u8(handle, "failed", &value) == ESP_OK) {
        runtime->failure_reboot_pending = value != 0;
    }
    if (nvs_get_str(handle, "reason", runtime->last_startup_failure_reason,
                    &reason_size) != ESP_OK) {
        runtime->last_startup_failure_reason[0] = '\0';
    }
    nvs_close(handle);
    runtime->boot_guard_ready = true;

