99percentpeople/esp32qjs/components/esp32qjs_runtime/src/esp32qjs_runtime.c
    esp_reset_reason_t reset_reason = esp_reset_reason();
    bool fault_reset = runtime_reset_is_startup_failure(reset_reason);
    bool failed_software_reset = reset_reason == ESP_RST_SW &&
                                 runtime->failure_reboot_pending;

    if (fault_reset || failed_software_reset) {
        if (runtime->startup_failure_count < UINT8_MAX) {
            runtime->startup_failure_count++;
        }
        if (fault_reset) {
            runtime_copy_string(runtime->last_startup_failure_reason,
                                sizeof(runtime->last_startup_failure_reason),
                                runtime_reset_failure_reason(reset_reason),
                                "runtime-failure");
        }
    } else {
        /* Operator reboots, external reset and power-on end the fault chain. */
        runtime->startup_failure_count = 0;
        runtime->last_startup_failure_reason[0] = '\0';
    }
    runtime->failure_reboot_pending = false;
    uint32_t level = runtime->startup_failure_count /
                     runtime->config.startup_failure_limit;
    runtime->safe_mode = level >= ESP32_MQUICKJS_SAFE_MODE_HARD
        ? ESP32_MQUICKJS_SAFE_MODE_HARD : (esp32_mquickjs_safe_mode_t)level;
    (void)runtime_boot_guard_commit(runtime);
    if (runtime->safe_mode != ESP32_MQUICKJS_SAFE_MODE_NORMAL) {
        ESP_LOGW(TAG, "safe mode level=%u, abnormal resets=%u, reason=%s",
                 (unsigned)runtime->safe_mode,
                 (unsigned)runtime->startup_failure_count,
                 runtime->last_startup_failure_reason);
    }
    return true;
}

static void runtime_boot_guard_arm(esp32qjs_runtime_t *runtime)
{
    if (runtime == NULL || !runtime->boot_guard_ready ||
        runtime->safe_mode >= ESP32_MQUICKJS_SAFE_MODE_HARD) {
        return;
    }
    runtime->startup_pending = true;
    runtime->startup_stabilizing = false;
    runtime->startup_returned_us = 0;
}

static void runtime_boot_guard_fail(esp32qjs_runtime_t *runtime,
                                    const char *reason)
{
    if (runtime == NULL || !runtime->boot_guard_ready) {
        return;
    }
    runtime->startup_pending = false;
    runtime->startup_stabilizing = false;
    /* The next software boot counts this reset once, alongside hardware faults. */
    runtime->failure_reboot_pending = true;
    runtime_copy_string(runtime->last_startup_failure_reason,
                        sizeof(runtime->last_startup_failure_reason),
                        reason,
                        "startup-failure");
    (void)runtime_boot_guard_commit(runtime);
}

static void runtime_boot_guard_disarm_intentional(esp32qjs_runtime_t *runtime)
{
    if (runtime == NULL || !runtime->boot_guard_ready ||
        (!runtime->startup_pending && !runtime->startup_stabilizing)) {
        return;
    }
    runtime->startup_pending = false;
    runtime->startup_stabilizing = false;
    runtime->startup_returned_us = 0;
    (void)runtime_boot_guard_commit(runtime);
}

static void runtime_boot_guard_note_returned(esp32qjs_runtime_t *runtime)
{
    if (runtime == NULL || !runtime->boot_guard_ready ||
        runtime->safe_mode >= ESP32_MQUICKJS_SAFE_MODE_HARD) {
        return;
    }
    runtime->startup_stabilizing = true;
    runtime->startup_returned_us = (uint64_t)esp_timer_get_time();
}

static void runtime_boot_guard_poll_healthy(esp32qjs_runtime_t *runtime)
{
    uint64_t healthy_us;

    if (runtime == NULL || !runtime->boot_guard_ready ||
        !runtime->startup_stabilizing) {
        return;
    }
    healthy_us = (uint64_t)runtime->config.startup_healthy_ms * 1000ULL;
    if ((uint64_t)esp_timer_get_time() - runtime->startup_returned_us < healthy_us) {
        return;
    }
    runtime->startup_pending = false;
    runtime->startup_stabilizing = false;
    runtime->startup_returned_us = 0;
}

static uint32_t runtime_reason_checksum(const char *reason)
{
    const unsigned char *cursor = (const unsigned char *)reason;
    uint32_t checksum = UINT32_C(2166136261);

    while (cursor != NULL && *cursor != '\0') {
        checksum ^= *cursor++;
        checksum *= UINT32_C(16777619);
    }
    return checksum ^ ESP32QJS_REBOOT_MARKER_MAGIC;
}

static bool runtime_reason_is_valid(const char *reason)
{
    const unsigned char *cursor = (const unsigned char *)reason;
    size_t length = 0;

    if (cursor == NULL || *cursor == '\0') {
        return false;
    }
    while (*cursor != '\0') {
        if (*cursor < 0x20U || *cursor == 0x7fU ||
            ++length > ESP32_MQUICKJS_CONTROL_REASON_MAX) {
            return false;
        }
        cursor++;
    }
    return true;
}

static void runtime_load_software_reason(esp32qjs_runtime_t *runtime)
{
    if (runtime != NULL && esp_reset_reason() == ESP_RST_SW &&
        s_reboot_marker.magic == ESP32QJS_REBOOT_MARKER_MAGIC &&
        runtime_reason_is_valid(s_reboot_marker.reason) &&
        s_reboot_marker.checksum == runtime_reason_checksum(s_reboot_marker.reason)) {
        runtime_copy_string(runtime->software_reason,
                            sizeof(runtime->software_reason),
                            s_reboot_marker.reason,
                            NULL);
        runtime->software_reason_available = true;
    }
    memset(&s_reboot_marker, 0, sizeof(s_reboot_marker));
}

static void runtime_store_software_reason(const char *reason)
{
    memset(&s_reboot_marker, 0, sizeof(s_reboot_marker));
    runtime_copy_string(s_reboot_marker.reason,
                        sizeof(s_reboot_marker.reason),
                        reason,
                        "javascript");
    s_reboot_marker.checksum = runtime_reason_checksum(s_reboot_marker.reason);
    s_reboot_marker.magic = ESP32QJS_REBOOT_MARKER_MAGIC;
}

static void runtime_clear_software_reason(void)
{
    memset(&s_reboot_marker, 0, sizeof(s_reboot_marker));
}

static void runtime_set_state(esp32qjs_runtime_t *runtime,
                              esp32_mquickjs_runtime_state_t state)
{
    if (runtime == NULL) {
        return;
    }
    portENTER_CRITICAL(&runtime->lifecycle_lock);
    runtime->state = state;
    portEXIT_CRITICAL(&runtime->lifecycle_lock);
}

static bool runtime_control_due(esp32qjs_runtime_t *runtime)
{
    bool due = false;
    uint64_t now_ms = (uint64_t)esp_timer_get_time() / 1000ULL;

    if (runtime == NULL) {
        return false;
    }
    portENTER_CRITICAL(&runtime->lifecycle_lock);
    due = runtime->pending_control && now_ms >= runtime->pending_due_at_ms;
    portEXIT_CRITICAL(&runtime->lifecycle_lock);
    return due;
}

static uint32_t runtime_control_wait_ms(esp32qjs_runtime_t *runtime,
                                        uint32_t requested_ms)
{
    uint64_t due_at_ms = 0;
    uint64_t now_ms = (uint64_t)esp_timer_get_time() / 1000ULL;
    bool pending = false;

    if (runtime == NULL) {
        return requested_ms;
    }
    portENTER_CRITICAL(&runtime->lifecycle_lock);
    pending = runtime->pending_control;
    due_at_ms = runtime->pending_due_at_ms;
    portEXIT_CRITICAL(&runtime->lifecycle_lock);
    if (!pending) {
        return requested_ms;
    }
    if (due_at_ms <= now_ms) {
        return 0;
    }
    if (due_at_ms - now_ms < requested_ms || requested_ms == UINT32_MAX) {
        uint64_t remaining = due_at_ms - now_ms;

        return remaining > UINT32_MAX ? UINT32_MAX : (uint32_t)remaining;
    }
    return requested_ms;
}

static bool runtime_host_status(void *opaque,
                                esp32_mquickjs_host_status_t *status)
{
    esp32qjs_runtime_t *runtime = opaque;

