99percentpeople/esp32qjs/components/esp32qjs_runtime/src/esp32qjs_runtime.c
    if (runtime == NULL || status == NULL) {
        return false;
    }
    memset(status, 0, sizeof(*status));
    status->managed = true;
    portENTER_CRITICAL(&runtime->lifecycle_lock);
    status->state = runtime->state;
    status->generation = runtime->generation;
    status->restart_count = runtime->restart_count;
    status->generation_started_us = runtime->generation_started_us;
    runtime_copy_string(status->last_restart_reason,
                        sizeof(status->last_restart_reason),
                        runtime->last_restart_reason,
                        NULL);
    status->pending_control = runtime->pending_control;
    status->pending_action = runtime->pending_action;
    runtime_copy_string(status->pending_reason,
                        sizeof(status->pending_reason),
                        runtime->pending_reason,
                        NULL);
    status->pending_requested_at_ms = runtime->pending_requested_at_ms;
    status->pending_due_at_ms = runtime->pending_due_at_ms;
    portEXIT_CRITICAL(&runtime->lifecycle_lock);

    runtime_copy_string(status->task_name,
                        sizeof(status->task_name),
                        runtime->task_name,
                        "js_runtime");
    status->task_stack_size = runtime->config.task_stack_size;
    status->task_priority = runtime->config.task_priority;
    status->task_watchdog_enabled = runtime->config.task_watchdog;
    status->task_watchdog_registered = runtime->watchdog_registered;
    status->js_watchdog_enabled = runtime->config.js_watchdog;
    status->js_watchdog_registered = runtime->js_watchdog_registered;
#ifdef CONFIG_ESP_TASK_WDT_TIMEOUT_S
    status->watchdog_timeout_ms = CONFIG_ESP_TASK_WDT_TIMEOUT_S * 1000U;
#endif
    status->last_outer_heartbeat_us = runtime->last_outer_heartbeat_us;
    runtime_copy_string(status->startup_script,
                        sizeof(status->startup_script),
                        runtime->startup_script,
                        "index.js");
    status->autorun_startup_script = runtime->config.autorun_startup_script;
    status->repl_enabled = runtime->config.enable_repl;
    status->mount_littlefs = runtime->config.mount_littlefs;
    status->require_littlefs = runtime->config.require_littlefs;
    status->littlefs_read_only = runtime->config.littlefs_read_only;
    status->format_littlefs_on_mount_fail =
        runtime->config.format_littlefs_on_mount_fail;
    status->littlefs_mounted = runtime->littlefs_mounted;
    runtime_copy_string(status->fs_root,
                        sizeof(status->fs_root),
                        ESP32_MQUICKJS_LITTLEFS_BASE_PATH,
                        ESP32_MQUICKJS_LITTLEFS_BASE_PATH);
    status->mount_secondary_littlefs = runtime->config.mount_secondary_littlefs;
    status->require_secondary_littlefs = runtime->config.require_secondary_littlefs;
    status->secondary_littlefs_mounted = runtime->secondary_littlefs_mounted;
    runtime_copy_string(status->secondary_partition,
                        sizeof(status->secondary_partition),
                        runtime->secondary_littlefs_partition_label,
                        "data");
    runtime_copy_string(status->secondary_root,
                        sizeof(status->secondary_root),
                        runtime->secondary_littlefs_base_path,
                        "/data");
    status->restart_runtime_available = true;
    status->reboot_available = true;
    status->restart_timeout_ms = runtime->config.restart_timeout_ms;
    status->restart_failure_action = runtime->config.restart_failure_action;
    status->software_reason_available = runtime->software_reason_available;
    runtime_copy_string(status->software_reason,
                        sizeof(status->software_reason),
                        runtime->software_reason,
                        NULL);
    status->safe_mode_available = runtime->boot_guard_ready;
    status->safe_mode = runtime->safe_mode;
    status->startup_failure_count = runtime->startup_failure_count;
    status->startup_failure_limit = runtime->config.startup_failure_limit;
    status->startup_healthy_ms = runtime->config.startup_healthy_ms;
    status->startup_pending = runtime->startup_pending;
    status->startup_stabilizing = runtime->startup_stabilizing;
    runtime_copy_string(status->last_startup_failure_reason,
                        sizeof(status->last_startup_failure_reason),
                        runtime->last_startup_failure_reason,
                        NULL);
    return true;
}

static esp32_mquickjs_control_result_t runtime_request_control_hook(
    void *opaque,
    esp32_mquickjs_control_action_t action,
    const char *reason,
    uint32_t delay_ms,
    esp32_mquickjs_control_receipt_t *receipt)
{
    esp32qjs_runtime_t *runtime = opaque;
    uint64_t requested_at_ms = (uint64_t)esp_timer_get_time() / 1000ULL;

    if (runtime == NULL || !runtime_reason_is_valid(reason) || receipt == NULL ||
        delay_ms > 60000U ||
        (action != ESP32_MQUICKJS_CONTROL_RESTART_RUNTIME &&
         action != ESP32_MQUICKJS_CONTROL_REBOOT)) {
        return ESP32_MQUICKJS_CONTROL_INVALID_STATE;
    }
    portENTER_CRITICAL(&runtime->lifecycle_lock);
    if (runtime->pending_control) {
        portEXIT_CRITICAL(&runtime->lifecycle_lock);
        return ESP32_MQUICKJS_CONTROL_ALREADY_PENDING;
    }
    if (runtime->state != ESP32_MQUICKJS_RUNTIME_RUNNING &&
        runtime->state != ESP32_MQUICKJS_RUNTIME_STARTING) {
        portEXIT_CRITICAL(&runtime->lifecycle_lock);
        return ESP32_MQUICKJS_CONTROL_INVALID_STATE;
    }
    runtime->pending_control = true;
    runtime->pending_action = action;
    runtime_copy_string(runtime->pending_reason,
                        sizeof(runtime->pending_reason),
                        reason,
                        "javascript");
    runtime->pending_requested_at_ms = requested_at_ms;
    runtime->pending_due_at_ms = requested_at_ms + delay_ms;
    receipt->action = action;
    receipt->generation = runtime->generation;
    receipt->requested_at_ms = requested_at_ms;
    receipt->due_at_ms = runtime->pending_due_at_ms;
    portEXIT_CRITICAL(&runtime->lifecycle_lock);
    runtime_boot_guard_disarm_intentional(runtime);
    esp32_mquickjs_notify_activity(&runtime->engine);
    return ESP32_MQUICKJS_CONTROL_ACCEPTED;
}

void esp32qjs_runtime_default_config(esp32qjs_runtime_config_t *config)
{
    if (config == NULL) {
        return;
    }
    memset(config, 0, sizeof(*config));
    config->js_heap_size = (size_t)CONFIG_ESP32QJS_JS_HEAP_SIZE;
    config->eval_timeout_ms = ESP32_MQUICKJS_DEFAULT_EVAL_TIMEOUT_MS;
    config->task_stack_size = (uint32_t)CONFIG_ESP32QJS_RUNTIME_TASK_STACK_SIZE;
    config->task_priority = (uint32_t)CONFIG_ESP32QJS_RUNTIME_TASK_PRIORITY;
    config->stop_timeout_ms = (uint32_t)CONFIG_ESP32QJS_RUNTIME_STOP_TIMEOUT_MS;
    config->restart_timeout_ms =
        (uint32_t)CONFIG_ESP32QJS_RUNTIME_RESTART_TIMEOUT_MS;
#ifdef CONFIG_ESP32QJS_RUNTIME_RESTART_FAILURE_STOP
    config->restart_failure_action = ESP32_MQUICKJS_RESTART_FAILURE_STOP;
#else
    config->restart_failure_action = ESP32_MQUICKJS_RESTART_FAILURE_REBOOT;
#endif
#ifdef CONFIG_ESP32QJS_JS_HEAP_PREFER_PSRAM
    config->prefer_psram = true;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_FS
    config->mount_littlefs = true;
#endif
    config->require_littlefs = false;
#ifdef CONFIG_ESP32QJS_SECONDARY_LITTLEFS
    config->require_littlefs = true;
    config->mount_secondary_littlefs = true;
#ifdef CONFIG_ESP32QJS_SECONDARY_LITTLEFS_REQUIRED
    config->require_secondary_littlefs = true;
#endif
    config->secondary_littlefs_partition_label =
        CONFIG_ESP32QJS_SECONDARY_LITTLEFS_PARTITION_LABEL;
    config->secondary_littlefs_base_path =
        CONFIG_ESP32QJS_SECONDARY_LITTLEFS_BASE_PATH;
#endif
#ifdef CONFIG_ESP32QJS_LITTLEFS_READ_ONLY
    config->littlefs_read_only = true;
#endif
#ifdef CONFIG_ESP32QJS_LITTLEFS_FORMAT_ON_MOUNT_FAIL
    config->format_littlefs_on_mount_fail = true;
#endif
#ifdef CONFIG_ESP32QJS_AUTORUN_INDEX_JS
    config->autorun_startup_script = true;
#endif
#ifdef CONFIG_ESP32QJS_ENABLE_REPL
    config->enable_repl = true;
#endif
#ifdef CONFIG_ESP32QJS_RUNTIME_TASK_WATCHDOG
    config->task_watchdog = true;
#endif
#ifdef CONFIG_ESP32QJS_RUNTIME_JS_WATCHDOG
    config->js_watchdog = true;
#endif
#ifdef CONFIG_ESP32QJS_RUNTIME_STARTUP_GUARD
    config->startup_guard = true;
    config->startup_failure_limit =
        (uint32_t)CONFIG_ESP32QJS_RUNTIME_STARTUP_FAILURE_LIMIT;
    config->startup_healthy_ms =
        (uint32_t)CONFIG_ESP32QJS_RUNTIME_STARTUP_HEALTHY_MS;
#else
    config->startup_failure_limit = 2U;
    config->startup_healthy_ms = 30000U;
#endif
    config->startup_script = "index.js";
    config->task_name = "js_runtime";
}

static bool runtime_release_unstarted(esp32qjs_runtime_t *runtime)
{
    if (runtime == NULL) {
        return false;
    }
    if (runtime->ctx != NULL) {
        if (!esp32_mquickjs_destroy(runtime->ctx, &runtime->engine)) {
            return false;
        }
        runtime->ctx = NULL;
    }
    esp32_mquickjs_release_persistent_state(&runtime->engine);
#if CONFIG_ESP32QJS_ENABLE_REPL
    if (runtime->config.enable_repl) {
        esp32qjs_interactive_uninstall_log_bridge();
        esp32qjs_interactive_console_init(NULL);
    }
#endif
    if (runtime->secondary_littlefs_mounted) {
        esp32_mquickjs_unmount_littlefs_partition(
            runtime->secondary_littlefs_partition_label);
        runtime->secondary_littlefs_mounted = false;
    }
    if (runtime->littlefs_mounted) {
        esp32_mquickjs_unmount_littlefs();
        runtime->littlefs_mounted = false;
    }
    heap_caps_free(runtime->js_heap);
    runtime->js_heap = NULL;
    if (runtime->stopped != NULL) {
        vSemaphoreDelete(runtime->stopped);
    }
    heap_caps_free(runtime);
    return true;
}

