99percentpeople/esp32qjs/components/esp32qjs_runtime/src/esp32qjs_runtime.c
static bool runtime_startup_path_is_safe(const char *path)
{
    const unsigned char *cursor = (const unsigned char *)path;

    if (path == NULL || path[0] == '\0' || path[0] == '/') {
        return false;
    }
    while (*cursor != '\0') {
        if (!( (*cursor >= 'a' && *cursor <= 'z') ||
               (*cursor >= 'A' && *cursor <= 'Z') ||
               (*cursor >= '0' && *cursor <= '9') ||
               *cursor == '/' || *cursor == '_' || *cursor == '-' || *cursor == '.')) {
            return false;
        }
        cursor++;
    }
    return strstr(path, "..") == NULL;
}

static void runtime_run_startup(esp32qjs_runtime_t *runtime)
{
    JSValue result;

    if (runtime == NULL || runtime->ctx == NULL ||
        !runtime->config.autorun_startup_script ||
        !runtime->littlefs_mounted ||
        runtime->safe_mode >= ESP32_MQUICKJS_SAFE_MODE_HARD) {
        return;
    }
    if (!runtime_startup_path_is_safe(runtime->startup_script)) {
        ESP_LOGE(TAG, "Unsafe startup script path: %s", runtime->startup_script);
        return;
    }

    runtime_boot_guard_arm(runtime);

#if CONFIG_ESP32_MQUICKJS_FEATURE_FS
    result = esp32_mquickjs_load_startup_from_active_fs(runtime->ctx,
                                                        &runtime->engine,
                                                        runtime->startup_script);
#else
    return;
#endif
    if (JS_IsException(result)) {
        esp32_mquickjs_print_exception(runtime->ctx);
        runtime_boot_guard_fail(runtime, "startup-exception");
        runtime_store_software_reason("startup-exception");
        ESP_LOGE(TAG, "startup script failed; rebooting");
        esp_restart();
    }
    runtime_boot_guard_note_returned(runtime);
}

static bool runtime_create_generation(esp32qjs_runtime_t *runtime)
{
    if (runtime == NULL || runtime->ctx != NULL) {
        return false;
    }
    runtime->ctx = esp32_mquickjs_create(runtime->js_heap,
                                          runtime->config.js_heap_size,
                                          &runtime->engine,
                                          runtime->config.eval_timeout_ms);
    if (runtime->ctx == NULL) {
        ESP_LOGE(TAG, "MQuickJS context creation failed");
        return false;
    }
    esp32_mquickjs_set_system_hooks(&runtime->engine,
                                     runtime_host_status,
                                     runtime_request_control_hook,
                                     runtime);
    esp32_mquickjs_set_cooperate_hook(&runtime->engine, runtime_cooperate, runtime);
    runtime->engine.js_heap_size = runtime->config.js_heap_size;
    runtime->engine.js_heap_in_psram = esp_ptr_external_ram(runtime->js_heap);
    runtime->engine.repl_enabled = runtime->config.enable_repl;
    runtime->engine.auto_run_startup_script =
        runtime->config.autorun_startup_script;
    runtime->engine.format_littlefs_on_mount_fail =
        runtime->config.format_littlefs_on_mount_fail;
    runtime->engine.littlefs_mounted = runtime->littlefs_mounted;
    runtime_copy_string(runtime->engine.startup_fs_root,
                        sizeof(runtime->engine.startup_fs_root),
                        ESP32_MQUICKJS_LITTLEFS_BASE_PATH,
                        ESP32_MQUICKJS_LITTLEFS_BASE_PATH);
#if CONFIG_ESP32QJS_ENABLE_REPL
    if (runtime->config.enable_repl) {
        runtime->engine.prepare_output = esp32qjs_interactive_prepare_output;
        runtime->engine.prepare_output_opaque = NULL;
    }
#endif
    if (!esp32_mquickjs_install_globals(runtime->ctx, &runtime->engine)) {
        ESP_LOGE(TAG, "MQuickJS global initialization failed");
        if (esp32_mquickjs_destroy_generation(runtime->ctx, &runtime->engine)) {
            runtime->ctx = NULL;
        }
        return false;
    }
    if (runtime->config.install_globals != NULL &&
        !runtime->config.install_globals(runtime->ctx,
                                         &runtime->engine,
                                         runtime->config.opaque)) {
        ESP_LOGE(TAG, "Application global installer failed");
        if (esp32_mquickjs_destroy_generation(runtime->ctx, &runtime->engine)) {
            runtime->ctx = NULL;
        }
        return false;
    }
    runtime->generation_started_us = (uint64_t)esp_timer_get_time();
    return true;
}

static void runtime_attach_current_task(void *opaque)
{
    esp32qjs_runtime_t *runtime = opaque;

    if (runtime != NULL) {
        esp32_mquickjs_attach_current_task(&runtime->engine);
    }
}

#if CONFIG_ESP32QJS_ENABLE_REPL
static uint32_t runtime_output_generation(void *opaque)
{
    esp32qjs_runtime_t *runtime = opaque;

    return runtime != NULL ? runtime->engine.output_generation : 0;
}

static void runtime_startup_callback(void *opaque)
{
    esp32qjs_runtime_t *runtime = opaque;

    runtime_run_startup(runtime);
    runtime_set_state(runtime, ESP32_MQUICKJS_RUNTIME_RUNNING);
}
#endif

static bool runtime_cooperate(void *opaque)
{
    esp32qjs_runtime_t *runtime = opaque;

    if (runtime == NULL) {
        return false;
    }
    /* Native Radio workers may cooperate while retiring SDK operations. The
     * registration belongs to the runtime task, not whichever worker calls us;
     * a worker also cannot keep a stuck JS task's user watchdog alive. */
    if (runtime->task == xTaskGetCurrentTaskHandle()) {
        if (runtime->watchdog_registered) {
            esp_task_wdt_reset();
        }
        if (runtime->engine.native_wait_depth > 0) {
            runtime_feed_js_watchdog(runtime);
        }
    }
    return !runtime->stop_requested && !runtime_control_due(runtime);
}

static void runtime_feed_js_watchdog(esp32qjs_runtime_t *runtime)
{
    if (runtime == NULL) {
        return;
    }
    runtime->last_outer_heartbeat_us = (uint64_t)esp_timer_get_time();
    if (runtime->js_watchdog_registered) {
        (void)esp_task_wdt_reset_user(runtime->js_watchdog_user);
    }
}

static void runtime_outer_heartbeat(esp32qjs_runtime_t *runtime)
{
    if (runtime == NULL) {
        return;
    }
    runtime_feed_js_watchdog(runtime);
    runtime_boot_guard_poll_healthy(runtime);
}

static esp32_mquickjs_poll_result_t runtime_poll_engine(esp32qjs_runtime_t *runtime)
{
    esp32_mquickjs_poll_result_t result;

