99percentpeople/esp32qjs/components/esp32qjs_runtime/src/esp32qjs_runtime.c
    if (runtime == NULL || runtime->ctx == NULL) {
        return ESP32_MQUICKJS_POLL_NONE;
    }
    if (runtime->watchdog_registered) {
        esp_task_wdt_reset();
    }
    runtime_outer_heartbeat(runtime);
    result = esp32_mquickjs_poll(runtime->ctx, &runtime->engine);
    if (runtime->watchdog_registered) {
        esp_task_wdt_reset();
    }
    runtime_outer_heartbeat(runtime);
    return result;
}

#if CONFIG_ESP32QJS_ENABLE_REPL
static esp32qjs_interactive_poll_result_t runtime_interactive_poll(void *opaque)
{
    return (esp32qjs_interactive_poll_result_t)runtime_poll_engine(opaque);
}

static void runtime_handle_line(void *opaque, const char *line)
{
    esp32qjs_runtime_t *runtime = opaque;
    JSValue result;

    if (runtime == NULL || runtime->ctx == NULL) {
        return;
    }
    result = esp32_mquickjs_eval(runtime->ctx,
                                 &runtime->engine,
                                 line,
                                 "<repl>",
                                 JS_EVAL_REPL | JS_EVAL_RETVAL);
    if (JS_IsException(result)) {
        esp32_mquickjs_print_exception(runtime->ctx);
    } else if (!JS_IsUndefined(result)) {
        JS_PrintValueF(runtime->ctx, result, JS_DUMP_LONG);
        printf("\n");
    }
}
#endif

static bool runtime_wait_for_activity(void *opaque, uint32_t timeout_ms)
{
    esp32qjs_runtime_t *runtime = opaque;
    bool notified;

    if (runtime == NULL) {
        return false;
    }
    timeout_ms = runtime_control_wait_ms(runtime, timeout_ms);
    if (runtime->js_watchdog_registered &&
        (timeout_ms == UINT32_MAX || timeout_ms > ESP32QJS_OUTER_HEARTBEAT_WAIT_MS)) {
        timeout_ms = ESP32QJS_OUTER_HEARTBEAT_WAIT_MS;
    }
    notified = esp32_mquickjs_wait_for_activity(&runtime->engine, timeout_ms);
    runtime_outer_heartbeat(runtime);
    return notified;
}

#if CONFIG_ESP32QJS_ENABLE_REPL
static bool runtime_should_stop(void *opaque)
{
    esp32qjs_runtime_t *runtime = opaque;

    return runtime == NULL || runtime->stop_requested || runtime_control_due(runtime);
}

static void runtime_notify_activity(void *opaque)
{
    esp32qjs_runtime_t *runtime = opaque;

    if (runtime != NULL) {
        esp32_mquickjs_notify_activity(&runtime->engine);
    }
}

static void runtime_notify_activity_from_isr(void *opaque, int *task_woken)
{
    (void)opaque;
    esp32_mquickjs_notify_active_runtime_from_isr(task_woken);
}
#endif

static bool runtime_take_due_control(esp32qjs_runtime_t *runtime,
                                     esp32_mquickjs_control_action_t *action,
                                     char reason[ESP32_MQUICKJS_CONTROL_REASON_MAX + 1U])
{
    uint64_t now_ms = (uint64_t)esp_timer_get_time() / 1000ULL;
    bool taken = false;

    if (runtime == NULL || action == NULL || reason == NULL) {
        return false;
    }
    portENTER_CRITICAL(&runtime->lifecycle_lock);
    if (runtime->pending_control && now_ms >= runtime->pending_due_at_ms) {
        *action = runtime->pending_action;
        runtime_copy_string(reason,
                            ESP32_MQUICKJS_CONTROL_REASON_MAX + 1U,
                            runtime->pending_reason,
                            "javascript");
        runtime->pending_control = false;
        runtime->pending_reason[0] = '\0';
        runtime->pending_requested_at_ms = 0;
        runtime->pending_due_at_ms = 0;
        taken = true;
    }
    portEXIT_CRITICAL(&runtime->lifecycle_lock);
    return taken;
}

static bool runtime_destroy_generation(esp32qjs_runtime_t *runtime,
                                       uint64_t deadline_us)
{
    if (runtime == NULL || runtime->ctx == NULL) {
        return true;
    }
    esp32_mquickjs_detach_current_task(&runtime->engine);
    for (;;) {
        if (esp32_mquickjs_destroy_generation(runtime->ctx, &runtime->engine)) {
            runtime->ctx = NULL;
            return true;
        }
        if ((uint64_t)esp_timer_get_time() >= deadline_us) {
            return false;
        }
        if (runtime->watchdog_registered) {
            esp_task_wdt_reset();
        }
        runtime_outer_heartbeat(runtime);
        vTaskDelay(1);
    }
}

static bool runtime_restart_generation(esp32qjs_runtime_t *runtime,
                                       const char *reason)
{
    char previous_reason[ESP32_MQUICKJS_CONTROL_REASON_MAX + 1U];
    uint32_t previous_generation;
    uint32_t previous_restart_count;
    uint64_t deadline_us;

    if (runtime == NULL || reason == NULL) {
        return false;
    }
    runtime_set_state(runtime, ESP32_MQUICKJS_RUNTIME_QUIESCING);
    deadline_us = (uint64_t)esp_timer_get_time() +
                  ((uint64_t)runtime->config.restart_timeout_ms * 1000ULL);
    if (!runtime_destroy_generation(runtime, deadline_us)) {
        return false;
    }

    runtime_set_state(runtime, ESP32_MQUICKJS_RUNTIME_RESTARTING);
    portENTER_CRITICAL(&runtime->lifecycle_lock);
    previous_generation = runtime->generation;
    previous_restart_count = runtime->restart_count;
    runtime_copy_string(previous_reason,
                        sizeof(previous_reason),
                        runtime->last_restart_reason,
                        NULL);
    runtime->generation++;
    runtime->restart_count++;
    runtime_copy_string(runtime->last_restart_reason,
                        sizeof(runtime->last_restart_reason),
                        reason,
                        "javascript");
    portEXIT_CRITICAL(&runtime->lifecycle_lock);

    runtime_set_state(runtime, ESP32_MQUICKJS_RUNTIME_STARTING);
    if (!runtime_create_generation(runtime)) {
        portENTER_CRITICAL(&runtime->lifecycle_lock);
        runtime->generation = previous_generation;
        runtime->restart_count = previous_restart_count;
        runtime_copy_string(runtime->last_restart_reason,
                            sizeof(runtime->last_restart_reason),
                            previous_reason,
                            NULL);
        portEXIT_CRITICAL(&runtime->lifecycle_lock);
        return false;
    }
    runtime_attach_current_task(runtime);
    ESP_LOGI(TAG,
             "JavaScript runtime generation %lu ready (restartCount=%lu, reason=%s)",
             (unsigned long)runtime->generation,
             (unsigned long)runtime->restart_count,
             reason);
    return true;
}

static bool runtime_handle_due_control(esp32qjs_runtime_t *runtime)
{
    esp32_mquickjs_control_action_t action;
    char reason[ESP32_MQUICKJS_CONTROL_REASON_MAX + 1U];

    if (!runtime_take_due_control(runtime, &action, reason)) {
        return true;
    }
    if (action == ESP32_MQUICKJS_CONTROL_REBOOT) {
        runtime_set_state(runtime, ESP32_MQUICKJS_RUNTIME_STOPPING);
        runtime_store_software_reason(reason);
        ESP_LOGW(TAG, "software reboot requested: %s", reason);
        esp_restart();
        return false;
    }
    ESP_LOGI(TAG, "restarting JavaScript runtime: %s", reason);
    runtime_store_software_reason(reason);
    if (runtime_restart_generation(runtime, reason)) {
        runtime_clear_software_reason();
        return true;
    }

    ESP_LOGE(TAG, "JavaScript runtime restart failed");
    runtime_set_state(runtime, ESP32_MQUICKJS_RUNTIME_FAILED);
    if (runtime->config.restart_failure_action ==
        ESP32_MQUICKJS_RESTART_FAILURE_REBOOT) {
        runtime_boot_guard_fail(runtime, "runtime-restart-failed");
        runtime_store_software_reason("runtime-restart-failed");
        esp_restart();
    } else {
        runtime_clear_software_reason();
    }
    return false;
}

