99percentpeople/esp32qjs/components/esp32qjs_runtime/src/esp32qjs_runtime.c
static void runtime_task(void *opaque)
{
    esp32qjs_runtime_t *runtime = opaque;
    bool failed = false;

    runtime->running = true;
    runtime_attach_current_task(runtime);
    if (runtime->config.task_watchdog && esp_task_wdt_add(NULL) == ESP_OK) {
        runtime->watchdog_registered = true;
    }
    if (runtime->config.js_watchdog &&
        esp_task_wdt_add_user("js_outer", &runtime->js_watchdog_user) == ESP_OK) {
        runtime->js_watchdog_registered = true;
    }
    runtime_outer_heartbeat(runtime);

    while (!runtime->stop_requested) {
        if (!runtime_handle_due_control(runtime)) {
            failed = runtime->state == ESP32_MQUICKJS_RUNTIME_FAILED;
            break;
        }
#if CONFIG_ESP32QJS_ENABLE_REPL
        if (runtime->config.enable_repl) {
            esp32qjs_interactive_run(&runtime->interactive_host, &runtime->banner);
        } else
#endif
        {
            runtime_outer_heartbeat(runtime);
            runtime_run_startup(runtime);
            runtime_set_state(runtime, ESP32_MQUICKJS_RUNTIME_RUNNING);
            while (!runtime->stop_requested && !runtime_control_due(runtime)) {
                if (runtime_poll_engine(runtime) == ESP32_MQUICKJS_POLL_NONE) {
                    runtime_wait_for_activity(runtime, UINT32_MAX);
                }
            }
        }
    }

    if (runtime->js_watchdog_registered) {
        esp_task_wdt_delete_user(runtime->js_watchdog_user);
        runtime->js_watchdog_registered = false;
        runtime->js_watchdog_user = NULL;
    }
    if (runtime->watchdog_registered) {
        esp_task_wdt_delete(NULL);
        runtime->watchdog_registered = false;
    }
#if CONFIG_ESP32QJS_ENABLE_REPL
    if (runtime->config.enable_repl) {
        esp32qjs_interactive_uninstall_log_bridge();
    }
#endif
    esp32_mquickjs_detach_current_task(&runtime->engine);
    runtime->running = false;
    runtime->task = NULL;
    if (!failed) {
        runtime_set_state(runtime, ESP32_MQUICKJS_RUNTIME_STOPPED);
    }
    xSemaphoreGive(runtime->stopped);
    vTaskDelete(NULL);
}

esp_err_t esp32qjs_runtime_create(const esp32qjs_runtime_config_t *config,
                                  esp32qjs_runtime_t **out_runtime)
{
    esp32qjs_runtime_t *runtime;

    if (config == NULL || out_runtime == NULL || config->js_heap_size == 0 ||
        config->task_stack_size == 0 || config->task_priority == 0 ||
        config->restart_timeout_ms == 0 ||
        (config->littlefs_read_only &&
         config->format_littlefs_on_mount_fail) ||
        (config->startup_guard &&
         (config->startup_failure_limit == 0 || config->startup_healthy_ms == 0)) ||
        (config->restart_failure_action != ESP32_MQUICKJS_RESTART_FAILURE_REBOOT &&
         config->restart_failure_action != ESP32_MQUICKJS_RESTART_FAILURE_STOP)) {
        return ESP_ERR_INVALID_ARG;
    }
    *out_runtime = NULL;
    if (s_active_runtime != NULL) {
        return ESP_ERR_INVALID_STATE;
    }
#if !CONFIG_ESP32QJS_ENABLE_REPL
    if (config->enable_repl) {
        return ESP_ERR_NOT_SUPPORTED;
    }
#endif

    runtime = heap_caps_calloc(1, sizeof(*runtime), MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    if (runtime == NULL) {
        return ESP_ERR_NO_MEM;
    }
    runtime->config = *config;
    runtime->lifecycle_lock = (portMUX_TYPE)portMUX_INITIALIZER_UNLOCKED;
    runtime->state = ESP32_MQUICKJS_RUNTIME_CREATED;
    runtime->generation = 1U;
    runtime_load_software_reason(runtime);
    (void)runtime_boot_guard_load(runtime);
    runtime_copy_string(runtime->startup_script,
                        sizeof(runtime->startup_script),
                        config->startup_script,
                        "index.js");
    runtime_copy_string(runtime->task_name,
                        sizeof(runtime->task_name),
                        config->task_name,
                        "js_runtime");
    runtime_copy_string(runtime->secondary_littlefs_partition_label,
                        sizeof(runtime->secondary_littlefs_partition_label),
                        config->secondary_littlefs_partition_label,
                        "data");
    runtime_copy_string(runtime->secondary_littlefs_base_path,
                        sizeof(runtime->secondary_littlefs_base_path),
                        config->secondary_littlefs_base_path,
                        "/data");
    runtime->config.startup_script = runtime->startup_script;
    runtime->config.task_name = runtime->task_name;
    runtime->config.secondary_littlefs_partition_label =
        runtime->secondary_littlefs_partition_label;
    runtime->config.secondary_littlefs_base_path =
        runtime->secondary_littlefs_base_path;
    runtime->stopped = xSemaphoreCreateBinary();
    if (runtime->stopped == NULL) {
        runtime_release_unstarted(runtime);
        return ESP_ERR_NO_MEM;
    }

    if (config->prefer_psram) {
        runtime->js_heap = heap_caps_malloc_prefer(config->js_heap_size,
                                                    2,
                                                    MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT,
                                                    MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    } else {
        runtime->js_heap = heap_caps_malloc(config->js_heap_size,
                                            MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }
    if (runtime->js_heap == NULL) {
        runtime_release_unstarted(runtime);
        return ESP_ERR_NO_MEM;
    }

    if (config->mount_littlefs) {
        runtime->littlefs_mounted =
            esp32_mquickjs_mount_littlefs(
                config->format_littlefs_on_mount_fail,
                config->littlefs_read_only);
        if (!runtime->littlefs_mounted && config->require_littlefs &&
            runtime->safe_mode < ESP32_MQUICKJS_SAFE_MODE_HARD) {
            runtime_release_unstarted(runtime);
            return ESP_FAIL;
        }
    }
    if (config->mount_secondary_littlefs) {
        runtime->secondary_littlefs_mounted =
            esp32_mquickjs_mount_littlefs_partition(
                runtime->secondary_littlefs_partition_label,
                runtime->secondary_littlefs_base_path,
                false,
                false);
        if (!runtime->secondary_littlefs_mounted &&
            config->require_secondary_littlefs) {
            if (runtime->safe_mode == ESP32_MQUICKJS_SAFE_MODE_NORMAL) {
                bool restart = runtime->boot_guard_ready &&
                               config->restart_failure_action ==
                                   ESP32_MQUICKJS_RESTART_FAILURE_REBOOT;

