99percentpeople/esp32qjs/components/esp32qjs_runtime/src/esp32qjs_runtime.c
                if (restart) {
                    runtime_boot_guard_fail(runtime, "secondary-filesystem");
                    runtime_store_software_reason("secondary-filesystem");
                }
                runtime_release_unstarted(runtime);
                if (restart) {
                    ESP_LOGE(TAG,
                             "required secondary filesystem failed; rebooting");
                    esp_restart();
                }
                return ESP_FAIL;
            }
            ESP_LOGW(TAG,
                     "required secondary filesystem is unavailable in safe mode");
        }
    }

    runtime_set_state(runtime, ESP32_MQUICKJS_RUNTIME_STARTING);
    if (!runtime_create_generation(runtime)) {
        runtime_release_unstarted(runtime);
        return ESP_FAIL;
    }

#if CONFIG_ESP32QJS_ENABLE_REPL
    runtime->interactive_host.attach_current_task = runtime_attach_current_task;
    runtime->interactive_host.output_generation = runtime_output_generation;
    runtime->interactive_host.run_startup = runtime_startup_callback;
    runtime->interactive_host.poll = runtime_interactive_poll;
    runtime->interactive_host.handle_line = runtime_handle_line;
    runtime->interactive_host.wait_for_activity = runtime_wait_for_activity;
    runtime->interactive_host.should_stop = runtime_should_stop;
    runtime->interactive_host.notify_activity = runtime_notify_activity;
    runtime->interactive_host.notify_activity_from_isr = runtime_notify_activity_from_isr;
    runtime->interactive_host.opaque = runtime;
    runtime->banner.title = "mquickjs REPL on " CONFIG_ESP32_MQUICKJS_MCU_NAME;
    runtime->banner.subtitle = "Type JavaScript and press Enter.";
    runtime->banner.hint = "Run help() for usage.";
    if (config->enable_repl) {
        runtime->engine.prepare_output = esp32qjs_interactive_prepare_output;
        runtime->engine.prepare_output_opaque = NULL;
        esp32qjs_interactive_console_init(&runtime->interactive_host);
        esp32qjs_interactive_install_log_bridge(&runtime->interactive_host);
    }
#endif

    ESP_LOGI(TAG,
             "runtime ready: js_heap=%u bytes (%s), free_heap=%u bytes",
             (unsigned)config->js_heap_size,
             runtime->engine.js_heap_in_psram ? "psram" : "internal",
             (unsigned)esp_get_free_heap_size());
    s_active_runtime = runtime;
    *out_runtime = runtime;
    return ESP_OK;
}

esp_err_t esp32qjs_runtime_start(esp32qjs_runtime_t *runtime)
{
    BaseType_t created;

    if (runtime == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (runtime->task != NULL || runtime->running) {
        return ESP_ERR_INVALID_STATE;
    }
    runtime->stop_requested = false;
    runtime_set_state(runtime, ESP32_MQUICKJS_RUNTIME_STARTING);
    xSemaphoreTake(runtime->stopped, 0);
    created = xTaskCreate(runtime_task,
                          runtime->task_name,
                          runtime->config.task_stack_size,
                          runtime,
                          runtime->config.task_priority,
                          &runtime->task);
    if (created != pdPASS) {
        runtime->task = NULL;
        runtime_set_state(runtime, ESP32_MQUICKJS_RUNTIME_CREATED);
        return ESP_ERR_NO_MEM;
    }
    return ESP_OK;
}

void esp32qjs_runtime_request_stop(esp32qjs_runtime_t *runtime)
{
    if (runtime == NULL) {
        return;
    }
    if (runtime->state != ESP32_MQUICKJS_RUNTIME_FAILED) {
        runtime_set_state(runtime, ESP32_MQUICKJS_RUNTIME_STOPPING);
    }
    runtime->stop_requested = true;
    esp32_mquickjs_notify_activity(&runtime->engine);
}

esp_err_t esp32qjs_runtime_request_control(
    esp32qjs_runtime_t *runtime,
    esp32_mquickjs_control_action_t action,
    const char *reason,
    uint32_t delay_ms,
    esp32_mquickjs_control_receipt_t *receipt)
{
    esp32_mquickjs_control_result_t result;

    result = runtime_request_control_hook(runtime,
                                          action,
                                          reason,
                                          delay_ms,
                                          receipt);
    switch (result) {
    case ESP32_MQUICKJS_CONTROL_ACCEPTED:
        return ESP_OK;
    case ESP32_MQUICKJS_CONTROL_ALREADY_PENDING:
    case ESP32_MQUICKJS_CONTROL_INVALID_STATE:
        return ESP_ERR_INVALID_STATE;
    case ESP32_MQUICKJS_CONTROL_UNAVAILABLE:
    default:
        return ESP_ERR_NOT_SUPPORTED;
    }
}

esp_err_t esp32qjs_runtime_stop(esp32qjs_runtime_t *runtime,
                                uint32_t timeout_ms)
{
    TickType_t timeout_ticks;

    if (runtime == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (runtime->task == NULL && !runtime->running) {
        return ESP_OK;
    }
    if (xTaskGetCurrentTaskHandle() == runtime->task) {
        return ESP_ERR_INVALID_STATE;
    }
    esp32qjs_runtime_request_stop(runtime);
    if (timeout_ms == 0) {
        timeout_ms = runtime->config.stop_timeout_ms;
    }
    timeout_ticks = pdMS_TO_TICKS(timeout_ms);
    if (timeout_ticks == 0) {
        timeout_ticks = 1;
    }
    return xSemaphoreTake(runtime->stopped, timeout_ticks) == pdTRUE
        ? ESP_OK
        : ESP_ERR_TIMEOUT;
}

esp_err_t esp32qjs_runtime_destroy(esp32qjs_runtime_t *runtime)
{
    bool was_active;

    if (runtime == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (runtime->task != NULL || runtime->running) {
        return ESP_ERR_INVALID_STATE;
    }
    was_active = s_active_runtime == runtime;
    if (!runtime_release_unstarted(runtime)) {
        return ESP_ERR_INVALID_STATE;
    }
    if (was_active) {
        s_active_runtime = NULL;
    }
    return ESP_OK;
}

bool esp32qjs_runtime_is_running(const esp32qjs_runtime_t *runtime)
{
    return runtime != NULL && runtime->running;
}

JSContext *esp32qjs_runtime_context(esp32qjs_runtime_t *runtime)
{
    return runtime != NULL ? runtime->ctx : NULL;
}

esp32_mquickjs_runtime_t *esp32qjs_runtime_engine(esp32qjs_runtime_t *runtime)
{
    return runtime != NULL ? &runtime->engine : NULL;
}
